backend/1c-config/TradeUkr23/src/Catalogs/венд_МобильныеУстройства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>венд_МобильныеУстройства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта каталогу й замовлень пристрою; не задано = регламентована (грн). Ціни прайсу перераховуються в неї</Comment>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<Attribute>
				<Properties>
					<Name>АвтоПроведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаИсторииЗаказов</Name>
					<Comment>0 (не задано) = 30 днів за замовчуванням</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

backend/1c-config/TradeUkr23/src/Catalogs/венд_МобильныеУстройства/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗагрузитьСостояниеИзХранилища();
	СформироватьQR();
	УстановитьДоступностьИдентификатора();
	ОграничитьТипыСсылок();
	ЗаполнитьВалютуПоУмолчанию();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// Стан прив'язки — у ХранилищеОбщихНастроек (не в елементі). Код прив'язки генеруємо
	// ЛИШЕ для нового, ще НЕ спареного пристрою (нема ні коду, ні хешу токена) — щоб після
	// авторизації (сервіс гасить код) повторний запис картки НЕ відроджував код прив'язки.
	// (Запит логу ставиться зі списку пристроїв, тут його нема.)
	Ид = Объект.ИдентификаторУстройства;
	Если ПустаяСтрока(Справочники.венд_МобильныеУстройства.КодПривязки(Ид))
		И ПустаяСтрока(Справочники.венд_МобильныеУстройства.ХешТокена(Ид)) Тогда

		Справочники.венд_МобильныеУстройства.УстановитьКодПривязки(Ид, НовыйКодПривязки());

	КонецЕсли;
	ЗагрузитьСостояниеИзХранилища();
	СформироватьQR();
	УстановитьДоступностьИдентификатора();

КонецПроцедуры

// Поки картка відкрита — перечитуємо стан прив'язки зі сховища (сервіс гасить код при
// авторизації, але форму не смикає). Так після прив'язки код і QR зникають з відкритої
// форми самі, без повторного відкриття.
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПодключитьОбработчикОжидания("ПроверитьПривязку", 10);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПривязку()

	Если ПеречитатьСостояниеПривязки() Тогда

		ПоказатьПредупреждение(, НСтр("uk='Пристрій прив''язано — код погашено.';
			|ru='Устройство привязано — код погашен.';
			|en='Device paired — the pairing code is cleared.'"));

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгенерироватьКодПривязки(Команда)

	Если Объект.Ссылка.Пустая() Тогда

		ПоказатьПредупреждение(, НСтр("uk='Спершу збережіть пристрій, потім генеруйте код прив''язки.';
			|ru='Сначала сохраните устройство, затем генерируйте код привязки.';
			|en='Save the device first, then generate a pairing code.'"));
		Возврат;

	КонецЕсли;

	СгенерироватьКодПривязкиНаСервере();
	ПоказатьПредупреждение(, НСтр("uk='Згенеровано новий код прив''язки. Старий токен анульовано — дайте відсканувати новий QR.';
		|ru='Сгенерирован новый код привязки. Старый токен аннулирован — дайте отсканировать новый QR.';
		|en='New pairing code generated. The old token is revoked — scan the new QR.'"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Реквізити зберігають узагальнений тип СправочникСсылка (щоб метадані не залежали від УТ
// і валідувались окремо). Конкретні довідники УТ обмежуємо ПРОГРАМНО на формі через
// ОграничениеТипа — у злитій з УТ конфігурації типи резолвляться, у standalone не ламають.
&НаСервере
Процедура ОграничитьТипыСсылок()

	ОграничитьТипПоля("Склад", "СправочникСсылка.Склады");
	ОграничитьТипПоля("ТипЦен", "СправочникСсылка.ТипыЦенНоменклатуры");
	ОграничитьТипПоля("Валюта", "СправочникСсылка.Валюты");
	ОграничитьТипПоля("Менеджер", "СправочникСсылка.Пользователи");
	ОграничитьТипПоля("КонтрагентыКонтрагент", "СправочникСсылка.Контрагенты");
	ОграничитьТипПоля("ТоварыНоменклатура", "СправочникСсылка.Номенклатура");

КонецПроцедуры

// Новому пристрою підставляємо регламентовану валюту (грн) як стартову — оператор може
// змінити. Звернення до Констант резолвиться лише в злитій з УТ конфігурації (як і решта
// серверного коду сервісу); у standalone форма не виконується.
&НаСервере
Процедура ЗаполнитьВалютуПоУмолчанию()

	Если Объект.Ссылка.Пустая() И Не ЗначениеЗаполнено(Объект.Валюта) Тогда

		Попытка

			Объект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();

		Исключение

			// standalone (немає УТ-константи) — лишаємо порожньою

		КонецПопытки;

	КонецЕсли;

КонецПроцедуры

// Обмежує тип поля одним довідником, якщо такий тип існує в (злитій) конфігурації.
// Через рядкове ОписаниеТипов: відсутній у standalone тип не спричиняє помилки компіляції.
&НаСервере
Процедура ОграничитьТипПоля(ИмяЭлемента, ИмяТипа)

	Элемент = Элементы.Найти(ИмяЭлемента);
	Если Элемент = Неопределено Тогда

		Возврат;

	КонецЕсли;

	// У злитій з УТ конфігурації тип резолвиться; у standalone (немає УТ) — кидає виняток,
	// тоді просто лишаємо узагальнений СправочникСсылка.
	Попытка

		ОписаниеТипа = Новый ОписаниеТипов(ИмяТипа);

	Исключение

		Возврат;

	КонецПопытки;

	Если ОписаниеТипа.Типы().Количество() > 0 Тогда

		Элемент.ОграничениеТипа = ОписаниеТипа;

	КонецЕсли;

КонецПроцедуры

// Ідентифікатор = GUID посилання, тож після запису елемента його не можна змінювати.
// Для нового (ще не записаного) елемента лишаємо доступним; для записаного — тільки перегляд.
&НаСервере
Процедура УстановитьДоступностьИдентификатора()

	Элементы.ИдентификаторУстройства.ТолькоПросмотр = НЕ Объект.Ссылка.Пустая();

КонецПроцедуры

&НаСервере
Процедура СформироватьQR()

	// Ця УТ (стара БСП) не має УправлениеПечатью.ДанныеQRКода, тож QR малюємо в полі
	// HTML-документа бібліотекою qrcode.js, ВШИТОЮ у self-contained HTML (макет ГенераторQR).
	Шаблон = Справочники.венд_МобильныеУстройства.ПолучитьМакет("ГенераторQR").ПолучитьТекст();

	// Немає ідентифікатора або коду (напр. пристрій уже прив'язано — сервіс погасив код):
	// віддаємо макет із порожнім payload ({}), а НЕ "". Так поле HTML перемальовується (скрипт
	// бачить {} → «Немає даних для QR», без канваса), і старий QR-канвас зникає. Просте
	// присвоєння "" поле HTML не завжди перемальовує — старий канвас лишається.
	Если Не ЗначениеЗаполнено(Объект.ИдентификаторУстройства)
		Или ПустаяСтрока(КодПривязки) Тогда

		ТекстHTMLQR = Шаблон;
		Возврат;

	КонецЕсли;

	// Вміст QR — формат, що очікує мобільний сканер (scanner.js -> parseQr):
	// JSON { deviceId, apiUrl, code }. code — одноразовий код прив'язки (обмінюється на токен у /auth).
	АдресСервиса = Справочники.венд_МобильныеУстройства.АдресСервиса();
	Payload = "{""deviceId"":""" + Объект.ИдентификаторУстройства + """,""apiUrl"":""" + АдресСервиса
		+ """,""code"":""" + СокрЛП(КодПривязки) + """}";
	// Підставляємо payload у плейсхолдер макета і ставимо рядок у реквізит НА СЕРВЕРІ — лише
	// так платформа виконує <script> усередині поля HTML-документа (звірено з робочим прикладом).
	ТекстHTMLQR = СтрЗаменить(Шаблон,
		"<script id=""vendo-qr-payload"" type=""application/json"">{}</script>",
		"<script id=""vendo-qr-payload"" type=""application/json"">" + Payload + "</script>");

КонецПроцедуры

// Код прив'язки зберігається не в елементі, а у ХранилищеОбщихНастроек (модуль менеджера).
// Вантажимо у реквізит форми за ідентифікатором пристрою; для ще не записаного елемента —
// порожньо (код з'явиться після першого запису).
&НаСервере
Процедура ЗагрузитьСостояниеИзХранилища()

	Если Объект.Ссылка.Пустая() Тогда

		КодПривязки = "";
		Возврат;

	КонецЕсли;

	КодПривязки = Справочники.венд_МобильныеУстройства.КодПривязки(Объект.ИдентификаторУстройства);

КонецПроцедуры

// Перечитати код прив'язки зі сховища; QR перебудовуємо лише коли код змінився. Повертає
// Истина, якщо код щойно згас (пристрій прив'язано) — для сповіщення оператора.
&НаСервере
Функция ПеречитатьСостояниеПривязки()

	СтарыйКод = КодПривязки;
	ЗагрузитьСостояниеИзХранилища();
	Если КодПривязки <> СтарыйКод Тогда

		СформироватьQR();

	КонецЕсли;
	Возврат ЗначениеЗаполнено(СтарыйКод) И ПустаяСтрока(КодПривязки);

КонецФункции

// Новий одноразовий код прив'язки (GUID без дефісів).
&НаСервереБезКонтекста
Функция НовыйКодПривязки()

	Возврат СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");

КонецФункции

// Переприв'язка: новий код прив'язки + анулювання токена — усе у сховищі, елемент не пишемо.
&НаСервере
Процедура СгенерироватьКодПривязкиНаСервере()

	Ид = Объект.ИдентификаторУстройства;
	Справочники.венд_МобильныеУстройства.УстановитьКодПривязки(Ид, НовыйКодПривязки());
	Справочники.венд_МобильныеУстройства.УстановитьХешТокена(Ид, "");
	ЗагрузитьСостояниеИзХранилища();
	СформироватьQR();

КонецПроцедуры

#КонецОбласти
